## `base/`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.template_file.gpg_public_key: Reading...
data.template_file.gpg_public_key: Read complete after 0s [id=01c09e5a0f80f8a13453ade1b63f497a5ef4ecd12e5b33124936210766d3bc6f]
data.aws_iam_policy_document.api_gateway_assume_role_policy_document: Reading...
aws_route53_zone.main_zone: Refreshing state... [id=ZZ99RU07P712E]
aws_iam_user.ragedunicorn_cli_s3_admin: Refreshing state... [id=rg_cli_s3_admin]
aws_iam_user.ragedunicorn_console_admin: Refreshing state... [id=rg_console_admin]
data.aws_iam_policy_document.github_action_assume_role_policy_document: Reading...
data.aws_iam_policy_document.ragedunicorn_cli_s3_admin: Reading...
data.aws_iam_policy_document.api_gateway_push_logs_policy_document: Reading...
aws_iam_user.ragedunicorn_cli_admin: Refreshing state... [id=rg_cli_admin]
data.aws_iam_policy.admin_policy: Reading...
data.aws_iam_policy_document.api_gateway_assume_role_policy_document: Read complete after 0s [id=1004447381]
data.aws_iam_policy_document.github_action_assume_role_policy_document: Read complete after 0s [id=3378568038]
data.aws_iam_policy_document.ragedunicorn_cli_s3_admin: Read complete after 0s [id=3228841632]
data.aws_iam_policy_document.api_gateway_push_logs_policy_document: Read complete after 0s [id=4090776918]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::066249229474:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.cli_s3_admin_policy: Refreshing state... [id=arn:aws:iam::066249229474:policy/ragedunicorn_base_cli/rg-tf-ragedunicorn-admin-s3]
aws_iam_role.api_gateway_push_logs_role: Refreshing state... [id=rg-tf-base-api-gateway-push-logs]
aws_iam_access_key.ragedunicorn_cli_admin: Refreshing state... [id=AKIAQ63GDASRJYTDL3OA]
aws_iam_access_key.ragedunicorn_cli_s3_admin: Refreshing state... [id=AKIAQ63GDASRP6TNLM5S]
aws_iam_user_login_profile.ragedunicorn_console_admin: Refreshing state... [id=rg_console_admin]
data.aws_iam_policy.admin_policy: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_user_policy_attachment.console_admin_policy_attach: Refreshing state... [id=rg_console_admin-20220814161138659600000001]
aws_iam_user_policy_attachment.cli_admin_policy_attach: Refreshing state... [id=rg_cli_admin-20220814161138704100000002]
aws_iam_role.github_action: Refreshing state... [id=rg-github-action]
aws_iam_user_policy_attachment.cli_s3_admin_policy_attach: Refreshing state... [id=rg_cli_s3_admin-20220814161535935400000001]
aws_iam_role_policy.api_gateway_push_logs_policy: Refreshing state... [id=rg-tf-base-api-gateway-push-logs:rg-tf-ragedunicorn-base-api-gateway-push-logs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_user_login_profile.ragedunicorn_console_admin must be replaced
-/+ resource "aws_iam_user_login_profile" "ragedunicorn_console_admin" {
      ~ encrypted_password      = "wcFMA2MqKZuLldZLAQ/9G+IcT0YRNZP+quMSBmtxBQX8X1rbVfqRkJd9A5WyYwSO7/sgdzMDeZ+vdo1nI8IzFz28icERiVJlG0XusDEEjqUdILpdhd427xWSZyb61req2GwU903JV8h5BAjqcImzZ2edp+9FIeNteEIJY1tPyLSx0rP60lh4rKpguEdENh06kLFWmV7jAMw3vgpHAFWIz5+I6npTo+pBz6YKpzGaGaRNhpxyW4zgx6tesUVTpf7fFQvSu0s2RsuXNrTxK3540/XwG5JdBB5e9QJoe2SofowQCPu7PabLv36MmNhyujntXP4HFHhsFLF+mN9KqoxE3cyCvHtqDE9S1YXNnkoeDueSE4U1By9SJnYVqcvmdautGZXJR6rW5TX7+ObAFwUk/j6WI+HXFaU8jAUf6SK4f8qNviLZXfWAyEinNu5261rvpuyalPwhMTL4GrZkwTVJ0fhLWSAJlDXO7KibnTtQ+hqORipEo31gXylxNwCHK8osff9PzpfNLgflmZXtAB3B2fZA0WEVlLlmNwo2pwToL0w+XAhUKj5W6cJ2XCz1NItL97qAC5IM8JQNIzz/aYRoBkTF0VgksVJkUtP774s/yn660Hm0f8O7cBHwgOlYgIruXkCDzOEJvcDLuhp4B1D9tf3l3MPn9Hw0EE+p4DG4plY1DHn0vr3CaeObBQAwU/DSRQFcLBfdP47RL1UcK+6KvIdop9fH0+8siscCBzq85RrLN8BG0u3tyE64pM1+CbrPrVuT+4VmSrbHvB/AAEEdQsf1VXzljQ==" -> (known after apply)
      ~ id                      = "rg_console_admin" -> (known after apply)
      ~ key_fingerprint         = "08d31c2eda9508b9631e7686d9a67f8dbc6a139b" -> (known after apply)
      + password                = (known after apply)
      ~ password_reset_required = false -> (known after apply)
      ~ pgp_key                 = <<-EOT # forces replacement
            mQINBGL5GsYBEADGbZQEiS63wwkr04XmGzlg2wSoQzfoqVxSYcL0ZrYPMytPUiOZNLkVc4XhIciH
            DLfBOtAEYST0UpqduTj+5GXuJhRsv8HPaMcbZNUEM+YbATiCU5dn70WZ3p7NeG796H8QKSUN9RHU
            UhdnVR2q1D3/u2f0HcdTvwd6j35vyejEOkIjz+hI9CdkR49WT4h+ZFZ+Kf6ygr25H0SbeSvq96xU
            uLaWwDbOcIEd03NLu8zbfyUr+0byPLYcmmCGgsxlJfcZT4GgdxpvzKSbO2M913DINPLMhqkG4hQA
            CElq20T4TQfUsDyxNVPdD2Gszwe7Zwm/1x4/kv8GTYymPpZuuGp2POOf+Ms615mHHaMDDjLsbyQ6
            vCAVJ5xC7FNM/4BhHpxMBEjIfDr3KOprEwfcv7AhmEx9Me8/YqLZ0wF4CzbO1T3YFyHL4aXgS0W5
            HjTjbzIUgrd51FYEzXq8gLz6QQRlyN7dEa/KXb4g4w5HEOS4QMzTLgPamYqBQBCcyAlGtlGTLTC1
            3X7WhAUnXIB7TUzL64TIv1GCoMY8ubGN2RHKjdhlq8HtEwIBDJCeodx38ZchYgStx7zjhe3mLXUL
            +k9MxUD1jWBiMRNWUuP1N1kdm8JV2LIflF3w6BPBjEzGbVOLNrHEYL5HryNrTqyq08wccRHk/0XR
            y0IX6hZDckwQJQARAQABtCpyYWdlZHVuaWNvcm4gPHJhZ2VkLnVuaWNvcm4uZGV2QGdtYWlsLmNv
            bT6JAk4EEwEIADgWIQQI0xwu2pUIuWMedobZpn+NvGoTmwUCYvkaxgIbAwULCQgHAgYVCgkICwIE
            FgIDAQIeAQIXgAAKCRDZpn+NvGoTm5LFEAC5qQ8zphCz4yTqP+hiCIBrig1n/n8J49pPBXVEwxnd
            2UbKet8BMRvS1JhlQqtFuUu+rKNx84qiOSo6AiZOYBGk7h9XTxD/kaKkor+Jr2aBIWjSpwHYWxfy
            IDY4QbVGWaZfM9COaCSuw4NsWZ7Rxq1DmBk+3tZoYUsTU2iOKljE2Yfc0R7ylM2JIZlilO8BDJjX
            5d66n0o4PS68nYJpB0fDGjn8L53UVVxJyFMAxMvdXBLs5u3BOYrLBP/L167qRyjdZaA7kBmyNnyW
            5yIyKZKstkpLK+4GxZZpw5RAOWjIkxnyVZvL2c1rKW9zwSvA6zAelrHEwomdGYxNC8lISQkhPX2K
            R+nBG/jUKcJTIrP+fR8EJ5XwX32jEEFF00brgbdNj4GA6zAe2+ELJCV/rUDcBoTUbKzsKSt8Etbq
            MMqxqdYgxnjKMrgPM4u0qeHmSII0T30mp1xRHy/+O6aWJYVsMZi0UcJ6KDiFCZTeR4VtvXDdMMtb
            B91oAy1lcICHmVzulX48EnTUEiAB9YZzVPIdzBGCIrXB0VH1oLqkRhmbjgEiHWMok7RTiJzqytdu
            JJxJIlVzO/fvrcj3BOLNDPhW0VSQ+Yu/kbkXcPBsGVsgaZ0+upNCmMxdn0sjyrJ2yUbl9p1leV97
            lLj+3AVhn/CRBvMp+KM5fnWT6DAbMpg5/7kCDQRi+RrGARAAwMLUhm4afC5Ro5mLgsb4lCm2Sor2
            XTdvdQwvoRShs2VP2/eb/v+MJwt8tKVbqhuGQOvfki901OVGwp1MIWXXaQ9tesXqDtS/GNhLTMXO
            1RkLLLiXQ5lGO4+unPas1LjGV4uXooFbXkaP/BO6KGEy3oFvn4NCsoixja+0Bx2Ktn3dQUkbYCNQ
            fMV1txhKMjGkpM7IVxamxildSAR/ckCt3nGvATL49FYdXmHH/rk2V4InEcmY/QHVp9WgFLpISFLo
            46KJH76/BNMCy5QKCvF0qPVyBalxgvSvj5NkChs/QKV4r/8VyCBEVzRrsnt8jvymzps01M+YUKgs
            Bh6wol/yw5eaTbheDZXnHBVahOuzasC1M4M8n3NtFmUudwssJdBDOqPNPYMuxq8HIYIrZICqD3aC
            ijHXkW3Yp5+Ptrwtis1d7fzpcnKQPMpyMlHowRNRXLCtO/XkLs4Su2oaQY5iuj1ExGYfBERZlAF7
            3ACp7Xlk46Z5CGQHPYX2Kkz2nl7L1ysP4K1nQHOTC9KwM8YTmFcKZv5KIOAcJCW8FMfzzqdv+w1t
            IUPpYrxWjYy0wjxyT6vMpy+xADs2rlirouYp5NGpATJ07S5AbN9PVmPOtkM5RCPzCE4wAAVgyU74
            Cj72+hTzIbG/3iX+3RcrYJ8M/cTyCMLONKF8O6xO7uXt390AEQEAAYkCNgQYAQgAIBYhBAjTHC7a
            lQi5Yx52htmmf428ahObBQJi+RrGAhsMAAoJENmmf428ahObYScP/3cWQS5tR/nZfwKICfOSXPZF
            kpMinQ9QtyKF+DN6U1gV8STwhueCOzGgyHurbFuiZdD2AzxKgjbCEnO/TNrQSwUMl1/wHzz3pxMe
            HFmQkqIrFjfe+nVEUnlohuTAYHD8OATm4OL1CiP2aUuWBFZzV1Iw5Fmh3po1xukk+4QHXE583Jgd
            BMGi0OV8ImacwHIB3NDGwzBbKcCKY3gq/7mb/yg/u97aSzipyQIMSuvoRxwHydHi//XjpmLjdZNf
            2CL0QFg4nMsA2WUzTPNtldCGfkrPF8oSoDWHJhAy0XME+wQxmH/nxzOD20b7sHrfqkF1ZQvjbs0A
            8xtKZkvAYPsmB/jxjoq9zdYxDLz3rRzCANHay1Vh5jmDK0ezpjtdiytWxIfTXiE9h0+brs0Lo5h1
            ILiL/QWnKWYyUhnXRuyrwbWe4AG6YgMFR99R3CvC1T1DBURMRcB2lFtcXQANAXoTyZinKP8D4K04
            KE3T8HyRSvAFr1yrR2wpq6doXMgSjpjYjZgGsfvupygEYwAdCzxGrW47Unvj6QL+gfHInfzd9Dtg
            DSXd6luuIA2FK4F95NJqItGhuXhwQAT6C2PDQ0xNJKC6zckcRRik8wmgX6dhH7qi8Z51CkZoNOdm
            M6SQeqRRB7QHqrwckvpk7wUWhvqwXVJl7uBOUSEa8tapF0nexKIi
        EOT
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ console_admin_iam_password = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @RagedUnicorn, Action: `pull_request`*